# Сумма квадратов первых десяти натуральных чисел равна
# 1**2 + 2**2 + ... + 10**2 = 385
# Квадрат суммы первых десяти натуральных чисел равен
# (1 + 2 + ... + 10)**2 = 552 = 3025
# Следовательно, разность между суммой квадратов и квадратом суммы первых десяти натуральных чисел составляет 3025 − 385 = 2640.
# Найдите разность между суммой квадратов и квадратом суммы первых ста натуральных чисел.

n = 100
sum_of_squares = n * (n + 1) * (2 * n + 1) // 6
sum_num = 0

for i in range(1, n + 1):
    sum_num = sum_num + i

sum_squared = sum_num ** 2
print(sum_squared - sum_of_squares)
